import React, {Component} from "react";
import classes from "./UserRoom.module.css";

class UserRoom extends Component{

    render() {
        return (
           <div className={classes.UserRoom}>
               <div className={classes.topBlock}>
                   <button>Log out</button>
               </div>
               <div className={classes.leftBlock}>
                    <div className={classes.menuList}>
                        <img src="https://343791-1061892-raikfcquaxqncofqfm.stackpathdns.com/wp-content/uploads/2013/04/writer.jpg" alt=""/>
                        <ul>
                            <li>
                                <button className="btn btn-primary" style={{width:"100px"}}>About me</button>
                            </li>
                            <li>
                                <button className="btn btn-primary" style={{width:"100px"}}>Books</button>
                            </li>
                            <li>
                                <button className="btn btn-primary" style={{width:"100px"}}>Add book</button>
                            </li>
                            <li>
                                <button className="btn btn-primary" style={{width:"100px"}}>Settings</button>
                            </li>
                        </ul>
                    </div>
               </div>
               <div className={classes.centerBlock}>
                    <div className={classes.contentItems}>
                        <div className={classes.contentItemsTitle}>
                            <h4>Name:</h4>
                        </div>
                        <div className={classes.contentItemsValue}>
                            <p>
                                Муса Мураталиев
                            </p>
                        </div>
                    </div>
                   <div className={classes.contentItems}>
                       <div className={classes.contentItemsTitle}>
                           <h4>Biography:</h4>
                       </div>
                       <div className={classes.contentItemsValue}>
                           <p>
                               Жазуучу Муса Мураталиев Ат-Башы айылында 1942-жылы 15-февралда туулган. Мектепти бүтүргөндөн кийин геологиялык чалгындоодо металл ченегич, бетончу, электр оңдогуч, гезитте адабий кызматкер болуп иштеген.

                               1970-жылы Москвадагы М.Горький атындагы адабият институтун ийгиликтүү бүтүрүп келгенден кийин «Советская Киргизия» гезитинде кабарчы, телекөрсөтүүдө, Жаңылык Басылмалар Агенттигинин АПН Кыргыз ССРи боюнча бөлүмүндө өз кабарчы болуп иштеген. 1974-жылдан М.Мураталиев СССР Жазуучулар союзунда кыргыз адабияты боюнча кеңешчиси болгон.

                               М.Мураталиев бир топ прозалык жыйнактардын автору. Жазуучунун кээ бир чыгармалары француз, немис, поляк, литва, латыш, фарс ж.б. тилдерге которулган.

                               1942-жылы Кыргызстандын Нарын обулусуна караштуу Ат-Башы районундагы токой чарбасында иштеген үй-бүлөдө туулган.

                               1959-жылы Нарын шаарынын Токтогул атындагы орто мектепти бүтүргөндөн кийин Чүй өрөөнүндөгү геологиялык Чымбулак партиясына таандык экспедицияда металлометрист болуп иштеген.

                               1960-жылы Кыргыз мамлекеттик университетинин журналистика факультетинин кечки бөлүмүнө өтүп аны 1967-жылы бүтүргөн.

                               1964-жылы Кыргыз ССР Коомдук тартипти сактоо министрлигинин органы «Дзержинчи» гезитинде адабий кызматкер болгон.

                               1965-жылы Москвадагы М.Горький атындагы адабий институтунда окуп, 1970-жылы бүтүргөн.

                               1970-71-жылдары «Советская Киргизия» гезитинин Тянь-Шань обулусу боюнча өз кабарчысы болуп иштеген.

                               1971-72-жылдары Кыргыз ССР министрлер советинин телевидение жана радио уктуруу боюнча Мамлекеттик Комитетинде адабий берүүлөр редактору болгон.

                               1972-74-жылдары АПН агенттигинин Кыргыз CCРи боюнча өз кабарчысы болуп келген.

                               1974-92-жылдары СССР Жазуучулар Союзунун башкармасында СП СССР кыргыз адабияты боюнча кеңешчи болуп турган.

                               1992-97-жылдары СССР Жазуучулар Союзу таркатылгандан соң Жазуучулар Союздары уюмунда ССП түрк тилиндеги адабияттар боюнча кеңешчи болуп иштеген.

                               1997-2005-жылдары Москвадагы Щепкин М. С. атындагы театралдык жогорку окуу жайында сабак берген.

                               1993-2011-жылдары "Азаттык" радиосуна Орусиядагы (штаттан сырткары) кабарчысы болгон.

                               1974 жылдан СССР Жазуучулар Союзунун катарында болгон.

                               1997 жылдан Москва Жазуучлар Союузуна мүчө.

                               2011 жылдан Орусиялык ПЕН-центринин мүчөсү болгон.
                           </p>
                       </div>
                   </div>
               </div>
           </div>
        )
    }
}

export default UserRoom;